turbineRegionMesh/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible (pressure
    is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

forceCoeffs
{
    // Mandatory entries
    type            forceCoeffs;
    libs            ("libforces.so");
    patches         (airfoil-l1 airfoil-l2 airfoil-h1 airfoil-h2);


    // Optional entries

    // Field names
    p               p;
    U               U;
    rho     rhoInf;
    log         true;
    rhoInf      1.225;
    // Reference pressure [Pa]
    pRef            0;

    // Include porosity effects?
    porosity        yes;

    // Store and write volume field representations of forces and moments
    writeFields     yes;

    // Centre of rotation for moment calculations
    CofR            (0.25 0 0);

    // Lift direction
    liftDir         (0 1 0);

    // Drag direction
    dragDir         (1 0 0);

    // Pitch axis
    pitchAxis       (0 0 1);

    // Freestream velocity magnitude [m/s]
    magUInf         50;

    // Reference length [m]
    lRef            1;

    // Reference area [m2]
    Aref            1.2;

    // Spatial data binning
    // - extents given by the bounds of the input geometry
    binData
    {
        nBin        21;
        direction   (1 0 0);
        cumulative  yes;
    }
}
